{
  "projects": [
    {
      "title": "WeatherVue",
      "description": [
        "Stay ahead of the weather with up-to-the-minute weather information. WeatherVue provides you with current temperature, humidity, wind speed, and direction for your location."
      ],
      "imageSrc": "Images/weather1.png",
      "url": "https://my-weather-app-steel.vercel.app"
    },
    {
      "title": "Xcripto",
      "description": [
        "Stay informed with real-time cryptocurrency prices, market capitalizations, trading volumes, and historical data for thousands of cryptocurrencies. Our intuitive charts and graphs make it easy to track the performance of your favorite assets."
      ],
      "imageSrc": "Images/xcripto2.avif",
      "url": "https://xrypto-google-authentication.vercel.app"
    },

    {
      "title": "Shopping Cart",
      "description": [
        "Developed a shopping cart using useReducer () hook and Context API for state management as an alternative to Redux.",
        "Implemented functionalities like adding and removing products, filtering products based on user specific criteria, etc.",
        "Suitable for integration into an E-commerce website to efficiently manage the cart section."
      ],
      "imageSrc": "Images/cart1.avif",
      "url": "https://shopping-cart-mu-sage.vercel.app/"
    },
    {
      "title": "GymMaster",
      "description": [
        "New to a specific exercise? GymMaster provides step-by-step video tutorials and detailed instructions, making sure you execute each movement correctly and effectively."
      ],
      "imageSrc": "Images/gym_app.png",
      "url": "https://gym-application-khaki.vercel.app/"
    },
    {
      "title": "Yodo",
      "description": ["Unavailable due to API changes"],
      "imageSrc": "Images/Yodo1.png"
    },
    {
      "title": "Book Keeper",
      "description": [
        "Rediscover the joy of reading and book ownership with our book store application. Your personal library is now just a click away, and every book you love is securely stored for your enjoyment. Welcome to the future of book management!"
      ],
      "imageSrc": "Images/book-store.avif",
      "url": "https://book-store-mern-six.vercel.app/"
    }
  ]
}
